Fluid<->Solid/implicit_highE/Fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0.0 0.0 0.0)
    (1.0 0.0 0.0)
    (0.0 0.875 0.0)
    (1.0 0.875 0.0)
    (0.0 0.875 1.0)
    (0.0 0.0 1.0)
    (1.0 0.0 1.0)
    (1.0 0.875 1.0)
    (1.0 1.0 0.0)
    (0.0 1.0 0.0)
    (1.0 1.0 1.0)
    (0.0 1.0 1.0)
);

blocks
(
hex (5 4 7 6 0 2 3 1)  (28 32 32) simpleGrading (1 1 1)
hex (9 8 10 11 2 3 7 4)  (32 32 4) simpleGrading (1 1 1)
);

patches
(
     patch inlet
    (
        (2 4 11 9)
    )
     wall fixedWalls
    (
        (1 3 7 6)
        (2 0 5 4)
        (0 2 3 1)
        (5 6 7 4)
        (4 7 10 11)
        (3 2 9 8)
    )
     wall bottomWall
    (
        (0 1 6 5)
    )
     wall movingWall
    (
        (8 9 11 10)
    )
     wall outlet
    (
        (7 3 8 10)
    )
);

// ************************************************************************* //